---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.ShadeDepth
source: html/14040f22-1265-69ae-1224-da378fcff384.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.ShadeDepth Property

Used for the conceptual energy model.
 Amount that auto-generated shading will extend from auto-generated windows.

## Syntax (C#)
```csharp
public double ShadeDepth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The shade depth is less than zero.